<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0 (https://github.com/homebysix/recipe-robot)

This recipe is based on com.github.jaharmi.munki.Spectacle and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Description</key>
	<string>Downloads the latest version of Spectacle and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.Spectacle</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/spectacle</string>
		<key>NAME</key>
		<string>app_spectacle</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>description</key>
			<string>Window manager with simple keyboard navigation. The installation must be done by a wycomco employee.</string>
			<key>category</key>
			<string>Productivity</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>Fenstermanager mit einfacher Tastatursteuerung. Die Installation bedingt einen Vor-Ort-Termin eines wycomco-Technikers.</string>
				</dict>
			</dict>
			<key>preinstall_script</key>
			<string>
			</string>
			<key>developer</key>
			<string>Eric Czarny</string>
			<key>display_name</key>
			<string>Spectacle</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.jaharmi.munki.Spectacle</string>
</dict>
</plist>
