<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Oracle Java 8 JRE CPU release and imports into Munki.
The flat installer pkg within the installer app is copied out and imported.

Read more about CPU and PSU releases here:
    http://www.oracle.com/technetwork/java/javase/downloads/cpu-psu-explained-2331472.html

To use this recipe, you must accept the Oracle Binary Code License Agreement
for Java SE.
http://www.oracle.com/technetwork/java/javase/terms/license/index.html

The package's receipt version is useless, so we make an installs item for
the prefPane bundle, which has historically had consistent versioning.

This recipe is based on com.github.autopkg.munki.OracleJava8 and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.
</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.OracleJava8</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/plugins/java</string>
		<key>NAME</key>
		<string>java8</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>description</key>
			<string>Java SE Runtime Environment 8 ermöglicht das Ausführen von Java Anwendungen und Applets.
			
			Java SE Runtime Environment 8 enables the execution of Java applications and applets.</string>
			<key>display_name</key>
			<string>Java 8</string>
			<key>minimum_os_version</key>
			<string>10.7.3</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>uninstall_method</key>
			<string>uninstall_script</string>
			<key>uninstall_script</key>
			<string>#!/bin/sh
            # From http://www.java.com/en/download/help/mac_uninstall_java.xml
            rm -fr /Library/Internet\ Plug-Ins/JavaAppletPlugin.plugin
            pkgutil --forget com.oracle.jre
            </string>
			<key>uninstallable</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.OracleJava8</string>
</dict>
</plist>
