<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and package the latest LibreOffice with the right language. Imports it into Munki. Set RELEASE to either "fresh" or "still"

This recipe is based on com.github.sebtomasi.munki.LibreOfficeLangPack and customized by wycomco (http://www.wycomco.de)
to support a different naming convention for munki and German as a default language.</string>
    <key>Identifier</key>
    <string>com.github.wycomco.munki.LibreOffice_de</string>
    <key>Input</key>
    <dict>
    <key>LANGUAGE_CODE</key>
    <string>de</string>
    <key>NAME</key>
    <string>app_libreoffice_de</string>
    <key>MUNKI_CATEGORY</key>
    <string>Productivity</string>
    <key>RELEASE</key>
    <string>still</string>
	<key>localized_strings</key>
	<dict>
		<key>fallback_locale</key>
		<string>en</string>
		<key>de</key>
		<dict>
			<key>category</key>
			<string>Produktivität</string>
			<key>description</key>
			<string>Installiert die deutsche Lokalisierung für LibreOffice</string>
			<key>display_name</key>
			<string>LibreOffice deutsch</string>
		</dict>
	</dict>
    <key>TYPE</key>
    <string>mac-x86_64</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>generic/apps/libreoffice</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>generic</string>
            </array>
            <key>description</key>
            <string>LibreOffice is the free power-packed Open Source personal productivity suite for Windows, Macintosh and Linux, that gives you six feature-rich applications for all your document production and data processing needs: Writer, Calc, Impress, Draw, Math and Base.</string>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>The Document Foundation</string>
            <key>display_name</key>
            <string>LibreOffice german version</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>minimum_os_version</key>
            <string>10.9.0</string>
            <key>blocking_applications</key>
            <array>
                <string>LibreOffice</string>
            </array>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.sebtomasi.munki.LibreOfficeLangPack</string>
</dict>
</plist>
