<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of LibreOffice and imports into Munki. Set RELEASE to either "fresh" or "still".

LibreOffice Still is the stable version that has undergone more testing (over a longer time). It is usually recommended for more conservative use.
LibreOffice Fresh is the stable version with the most recent features. Users interested in taking advantage of our most innovative features should download and use our fresh version.

This recipe is based on io.github.hjuutilainen.munki.LibreOffice and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.LibreOffice</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>app_libreoffice</string>
		<key>RELEASE</key>
		<string>still</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/libreoffice</string>
		<key>MUNKI_CATEGORY</key>
		<string>Productivity</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>LibreOffice is the free power-packed Open Source personal productivity suite for Windows, Macintosh and Linux, that gives you six feature-rich applications for all your document production and data processing needs: Writer, Calc, Impress, Draw, Math and Base.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>LibreOffice ist eine freie Zusammenstellung gebräuchlicher Software für Arbeiten im Büro. Dazu gehören Programme zur Textverarbeitung, Tabellenkalkulation, Präsentation und zum Erstellen von Zeichnungen. Dies ist die englische Version.</string>
					<key>display_name</key>
					<string>LibreOffice englisch</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>The Document Foundation</string>
			<key>display_name</key>
			<string>LibreOffice english version</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.munki.LibreOffice</string>
</dict>
</plist>
