<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Egnyte Desktop Sync and imports it into Munki.

This recipe generally follows the guidelines outlined on this KB article:
    https://helpdesk.egnyte.com/hc/en-us/articles/202982694
With one exception: A postinstall script automatically launches the Sync app after installation.

The following input variables should be customized to your organization using a recipe override:
- LOCAL_ROOT
- DOMAIN
- REMOTE_FOLDERS
- SYNC_TYPE
- SYNC_ALL_LOCAL_FOLDERS
- SYNC_SPECIAL_CHAR_FILENAME

This recipe is based on com.github.homebysix.munki.EgnyteDesktopSync and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.

This recipe only applies as an update to an existing installation, since several needed parameters are stripped for generic usage. The original homebysix-receipt will not be called as parent for this reason.
</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.EgnyteDesktopSync</string>
	<key>Input</key>
	<dict>
		<key>LOCAL_ROOT</key>
		<string>~/Documents/Egnyte</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/egnyte</string>
		<key>NAME</key>
		<string>app_egnyte</string>
		<key>REMOTE_FOLDERS</key>
		<string>/Shared,/Private</string>
		<key>SYNC_ALL_LOCAL_FOLDERS</key>
		<string>true</string>
		<key>SYNC_SPECIAL_CHAR_FILENAME</key>
		<string>true</string>
		<key>SYNC_TYPE</key>
		<string>realtime</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>EgnyteDesktopSync</string>
				<string>EgnyteLocalCloud</string>
				<string>Egnyte Loader</string>
				<string>Egnyte Desktop Sync Uninstall</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Produktivität</string>
			<key>description</key>
			<string>Desktop Sync ermöglicht es Ihnen, Dateien auf Ihrem Computer zu erstellen, sie mit der Cloud zu synchronisieren und von jedem Gerät aus auf sie zuzugreifen, um sie problemlos mit anderen zu teilen. </string>
			<key>developer</key>
			<string>Egnyte Inc</string>
			<key>display_name</key>
			<string>Egnyte Desktop Sync</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
# Only launch the sync app if a user is logged in.
CURRENT_USER=$(/usr/bin/stat -f%Su /dev/console)
if [[ "$CURRENT_USER" != "root" &amp;&amp; "$CURRENT_USER" != "" ]]; then
    open /Applications/Egnyte\ Desktop\ Sync.app
fi
            </string>
			<key>preinstall_script</key>
			<string>#!/bin/sh
echo "[config.db]" &gt; /Library/Preferences/egnyteconfig.ini
echo "local_root=%LOCAL_ROOT% " &gt;&gt; /Library/Preferences/egnyteconfig.ini
echo "domain=%DOMAIN%" &gt;&gt; /Library/Preferences/egnyteconfig.ini
echo "remote_folders=%REMOTE_FOLDERS%" &gt;&gt; /Library/Preferences/egnyteconfig.ini
echo "sync_type=%SYNC_TYPE%" &gt;&gt; /Library/Preferences/egnyteconfig.ini
echo "sync_all_local_folders=%SYNC_ALL_LOCAL_FOLDERS%" &gt;&gt; /Library/Preferences/egnyteconfig.ini
echo "sync_special_char_filename=%SYNC_SPECIAL_CHAR_FILENAME%" &gt;&gt; /Library/Preferences/egnyteconfig.ini
            </string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>uninstall_method</key>
			<string>uninstall_script</string>
			<key>uninstall_script</key>
			<string>#!/bin/sh
rm /Library/Preferences/egnyteconfig.ini
cp /Applications/Egnyte\ Desktop\ Sync.app/Contents/Resources/uninstall_elc.sh ~
chmod +x ~/uninstall_elc.sh
sh ~/uninstall_elc.sh
rm ~/uninstall_elc.sh
            </string>
			<key>uninstallable</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.EgnyteDesktopSync</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
