<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Egnyte Connect package and imports into Munki.
	
	This recipe is based on com.github.dataJAR-recipes.munki.Egnyte Connect and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.EgnyteConnect</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>app_egnyteconnect</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/egnyte</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>developer</key>
			<string>Egnyte</string>
			<key>description</key>
			<string>Easily browse all the Egnyte files and folders that you have access to directly from Mac Finder or Windows Explorer. The Egnyte Connect Desktop App will allow you to access all the files you have available in the cloud without requiring all the disk space to store them. Disk space is only occupied temporarily by files that are currently open or were recently opened. The Egnyte Connect Desktop app will automatically download and upload files and folders as you create, rename, update, and delete them.</string>
			<key>display_name</key>
			<string>Egnyte Connect</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>Durchsuchen Sie ganz einfach alle Egnyte-Dateien und -Ordner, auf die Sie direkt über den Mac Finder oder den Windows Explorer zugreifen können. Mit der Egnyte Connect-Desktop-App können Sie auf alle in der Cloud verfügbaren Dateien zugreifen, ohne den gesamten Speicherplatz zum Speichern zu benötigen. Der Speicherplatz wird nur vorübergehend von Dateien belegt, die gerade geöffnet sind oder vor kurzem geöffnet wurden. Die Egnyte Connect Desktop-App lädt automatisch Dateien und Ordner herunter und lädt sie hoch, während Sie sie erstellen, umbenennen, aktualisieren und löschen.</string>
				</dict>
			</dict>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>update_for</key>
			<array>
				<string>app_egnyte_drive</string>
			</array>
			<key>minimum_os_version</key>
			<string>10.13.0</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.munki.Egnyte Connect</string>
</dict>
</plist>
