<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Egnyte Desktop Sync package and imports into Munki.
	
	This recipe is based on "com.github.dataJAR-recipes.munki.Egnyte Desktop Sync NoPrefs" and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.
	</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.EgnyteDesktopSync</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>app_egnytedesktopsync</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/egnyte</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Produktivität</string>
			<key>developer</key>
			<string>Egnyte</string>
			<key>description</key>
			<string>Desktop Sync ermöglicht es Ihnen, Dateien auf Ihrem Computer zu erstellen, sie mit der Cloud zu synchronisieren und von jedem Gerät aus auf sie zuzugreifen, um sie problemlos mit anderen zu teilen.</string>
			<key>display_name</key>
			<string>Egnyte Desktop Sync</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.munki.Egnyte Desktop Sync NoPrefs</string>
</dict>
</plist>
