<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest update for Adobe Reader and imports into Munki.
This recipe is based on com.github.autopkg.munki.AdobeReader with a customized URLProvider to respect the problem, that only English versions are delivered as full applications. Other languages need to update the application.
</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.AdobeReaderUpdates</string>
	<key>Input</key>
	<dict>
		<key>LANGUAGE</key>
		<string>German</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/adobe/adobereader</string>
		<key>NAME</key>
		<string>upd_adobereader</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Adobe Reader.app</string>
				<string>Adobe Acrobat Pro.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Produktivität</string>
			<key>description</key>
			<string>Adobe Reader (früher Acrobat Reader) ist ein Computerprogramm des Unternehmens Adobe zum Anzeigen von PDF-Dokumenten, also ein Dateibetrachter. Es ist Teil der Adobe-Acrobat-Produktfamilie. (Quelle: Wikipedia)</string>
			<key>developer</key>
			<string>Adobe</string>
			<key>display_name</key>
			<string>Adobe Reader</string>
			<key>minimum_os_version</key>
			<string>10.6.4</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>requires</key>
			<array>
				<string>app_adobereader-11.0.0</string>
			</array>
			<key>unattended_install</key>
			<true/>
			<key>update_for</key>
			<array>
				<string>app_adobereader</string>
			</array>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.wycomco.download.AdobeReaderUpdates</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>installs</key>
					<array>
						<dict>
							<key>CFBundleIdentifier</key>
							<string>com.adobe.Reader</string>
							<key>CFBundleName</key>
							<string>Adobe Reader</string>
							<key>CFBundleShortVersionString</key>
							<string>%version%</string>
							<key>CFBundleVersion</key>
							<string>%version%</string>
							<key>path</key>
							<string>/Applications/Adobe Reader.app</string>
							<key>type</key>
							<string>application</string>
							<key>version_comparison_key</key>
							<string>CFBundleShortVersionString</string>
						</dict>
					</array>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
