<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Parallels Desktop and imports it into Munki. This recipe has been tested with major versions 9, 10, 11, 12, and 13.
	
	This recipe is based on com.github.homebysix.munki.ParallelsDesktop and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.ParallelsDesktop13</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>13</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/parallels/%NAME%</string>
		<key>NAME</key>
		<string>app_parallelsdesktop13</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>description</key>
			<string>Parallels Desktop for Mac is a virtualization software for macOS on Intel processors. It is the main release 13.</string>
    		<key>category</key>
			<string>Productivity</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>Parallels Desktop for Mac ist eine Virtualisierungssoftware für macOS auf Intel-Prozessoren. Es handelt sich um die Hauptversion 13.</string>
					<key>category</key>
					<string>Produktivität</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>Parallels, Inc.</string>
			<key>display_name</key>
			<string>Parallels Desktop 13</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
chflags nohidden "/Applications/Parallels Desktop.app"
            </string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.munki.ParallelsDesktop</string>
</dict>
</plist>
