<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest VLC disk image and imports into Munki. This recipe is based on com.github.autopkg.munki.VLC and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.VLC</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/videolan/vlc-media-player</string>
		<key>NAME</key>
		<string>app_vlc-media-player</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Video</string>
			<key>description</key>
			<string>Der VLC media player (anfänglich „VideoLAN Client“ genannt) ist ein portabler, freier Medienabspieler sowohl für diverse Audio-, Videocodecs und Dateiformate als auch DVDs, Video-CDs und unterstützt unterschiedliche Streaming-Protokolle und Schnittstellen für TV-Karten (z. B. DirectShow und BDA). Er kann auch als Server zum Streaming in Uni- oder Multicast, in IPv4 und IPv6-Netzen oder als Transcoder für die unterstützten Video- und Audio-Formate verwendet werden.</string>
			<key>developer</key>
			<string>VideoLAN</string>
			<key>display_name</key>
			<string>VLC Media Player</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.VLC</string>
</dict>
</plist>
