<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Pacifist and imports it into a Munki repo. This recipe is based on com.github.arubdesu.munki.Pacifist and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
    <key>Identifier</key>
    <string>com.github.wycomco.munki.Pacifist</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>app_pacifist</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>generic/apps/pacifist</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>generic</string>
            </array>
			<key>category</key>
			<string>Utilities</string>
            <key>description</key>
            <string>Pacifist is a shareware application that opens Mac OS X .pkg package files, .dmg disk images, and .zip, .tar, .tar.gz, .tar.bz2, and .xar archives and allows you to extract individual files and folders out of them.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>Pacifist ist eine Shareware, die folgende Mac-Formate öffnet: .pkg-Pakete, .dmg-Images sowie .zip-, .tar-, .tar.gz-, .tar.bz2- und .xar-Archive. Hieraus lassen sich einzelne Dateien und Ordner extrahieren.</string>
					<key>category</key>
					<string>Dienstprogramme</string>
				</dict>
			</dict>
            <key>display_name</key>
            <string>Pacifist</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.arubdesu.munki.Pacifist</string>
</dict>
</plist>
