<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Google Earth disk image and imports into Munki. This recipe is based on com.github.autopkg.munki.google-earth and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.google-earth</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/google/earth</string>
		<key>NAME</key>
		<string>app_google_earth</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>description</key>
			<string>Google Earth is a computer program that renders a 3D representation of Earth based on satellite imagery. (Source: Wikipedia)</string>
			<key>category</key>
			<string>Education</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>Google Earth ist eine in der Grundform unentgeltliche Software der Google Inc. und stellt einen virtuellen Globus dar. Sie ist unter den Betriebssystemen MS Windows, Mac OS X und Linux verfügbar und durch die Linux-Emulation auch unter BSD-Derivaten lauffähig. Sie kann Satelliten- und Luftbilder unterschiedlicher Auflösung mit Geodaten überlagern und auf einem digitalen Höhenmodell der Erde zeigen. (Quelle: Wikipedia)</string>
					<key>category</key>
					<string>Bildung</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>Google</string>
			<key>display_name</key>
			<string>Google Earth</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.google-earth</string>
</dict>
</plist>
