<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the most current FontExplorer X Pro 6 Plugin for Photoshop CC 2018 and imports it into Munki.
	This recipe is based on com.github.foigus.munki.FontExplorerXPro6PluginPSCC2018 and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.FontExplorerXPro6PluginPSCC2018</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/plugins/monotype/fontexplorerx</string>
		<key>NAME</key>
		<string>FontExplorerXPro6PluginPSCC2018</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Adobe Photoshop CC 2018</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Plugin to allow Photoshop CC 2018 to activate document fonts from FontExplorer X Pro.</string>
			<key>display_name</key>
			<string>FontExplorer X Pro plugin for Photoshop CC 2018</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>Plugin, um Dokumentenschriften in Photoshop CC 2018 aus FontExplorer X Pro automatisch zu aktivieren.</string>
					<key>display_name</key>
					<string>FontExplorer-X-Pro-Plugin für Photoshop CC 2018</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>Monotype</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>installcheck_script</key>
			<string>#!/bin/bash
#
# Munki installcheck script
# Check if Photoshop CC 2018 is installed
#
# Author: andreas.vogel@wycomco.de
# Last update: 2018-07-02

if [ ! -d /Applications/Adobe\ Photoshop\ CC\ 2018/ ]; then
    echo "Adobe Photoshop CC 2018 is not installed. Exiting ..."
    exit 1
else
    echo "Adobe Photoshop CC 2018 found. Installing ..."
	exit 0
fi
</string>
			<key>unattended_install</key>
			<true/>
			<key>update_for</key>
			<array>
				<string>PhotoshopCC2018</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.munki.FontExplorerXPro6PluginPSCC2018</string>
</dict>
</plist>
