<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Google Earth Pro disk image and imports into Munki.

This recipe is based on com.github.autopkg.nmcspadden-recipes.munki.google-earth-pro and customized by wycomco (http://www.wycomco.de)
to support a different naming convention for munki and German as a default language.</string>
    <key>Identifier</key>
    <string>com.github.wycomco.munki.google-earth-pro</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>app_googleearthpro</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>generic/apps/google/earthpro</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>generic</string>
            </array>
			<key>category</key>
			<string>Education</string>
            <key>description</key>
            <string>Take a virtual journey to any location in the world. Explore 3D buildings, imagery, and terrain. Find cities, places and local businesses.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Bildung</string>
					<key>description</key>
					<string>Unternehme eine virtuelle Reise an jeden Ort der Welt. Erkunde 3D-Gebäude, Bilder und Gelände. Finde Städte, Orte und Geschäfte.</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>Google</string>
            <key>display_name</key>
            <string>Google Earth Pro</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.nmcspadden-recipes.munki.google-earth-pro</string>
</dict>
</plist>
