<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Parallels Desktop and imports it into Munki. This recipe has been tested with major versions 9, 10, 11, 12, and 13.
	
	This recipe is based on com.github.homebysix.munki.ParallelsDesktop and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.ParallelsDesktop12</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>12</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/parallels/%NAME%</string>
		<key>NAME</key>
		<string>app_parallelsdesktop12</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>description</key>
			<string>Parallels Desktop for Mac ist eine Virtualisierungssoftware für Mac OS X auf Intel-Prozessoren von Parallels. Es handelt sich um die Hauptversion 12.</string>
			<key>developer</key>
			<string>Parallels, Inc.</string>
			<key>display_name</key>
			<string>Parallels Desktop 12</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
chflags nohidden "/Applications/Parallels Desktop.app"
            </string>
			<key>maximum_os_version</key>
			<string>10.12.6</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.wycomco.download.ParallelsDesktop12</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Parallels Desktop.app</string>
				<key>overwrite</key>
				<true/>
				<key>source_path</key>
				<string>%pathname%/Parallels Desktop.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>version_comparison_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
