<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of AutoDMG from Github and imports into Munki.

This recipe is based on com.github.wardsparadox.munki.Clipy and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.
    </string>
    <key>Identifier</key>
    <string>com.github.wycomco.override.Clipy</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>generic/apps/clipy</string>
        <key>NAME</key>
        <string>app_clipy</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>generic</string>
            </array>
            <key>category</key>
            <string>Utilities</string>
            <key>description</key>
            <string>Clipy is a Clipboard extension app for macOS enabling you to store multiple clips.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Dienstprogramme</string>
					<key>description</key>
					<string>Clipy ist eine Erweiterung der Zwischenablage, die es einem mittels einer Historie ermöglicht, mehrere Clips abzurufen.</string>
				</dict>
			</dict>
            <key>name</key>
            <string>%NAME%</string>
            <key>display_name</key>
            <string>Clipy</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
            <key>developer</key>
            <string>Clipy Project</string>
			<key>minosversion</key>
			<string>10.10</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.wardsparadox.munki.Clipy</string>
</dict>
</plist>
