<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest 'The Unarchiver' and imports into Munki.

Note: this recipe has issues with repeated runs due to a bug in curl starting
with OS X 10.10.5. This has been fixed for the next version of AutoPkg, but not
yet in a released version. It should still download and unzip properly if is it is the first run, without an already-downloaded file.

The application's LSMinimumSystemVersion is currently inaccurate, but the
sparkle:minimumSystemVersion element is correct, so we use MunkiPkginfoMerger
to merge the minimum_os_version that is output from SparkleUpdateInfoProvider
in the .download ParentRecipe.

This recipe is based on com.github.autopkg.munki.TheUnarchiver and customized by wycomco (http://www.wycomco.de)
to support a different naming convention for munki and German as a default language.</string>
    <key>Identifier</key>
    <string>com.github.wycomco.munki.TheUnarchiver</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>app_theunarchiver</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>generic/apps/theunarchiver</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>generic</string>
            </array>
			<key>category</key>
			<string>Productivity</string>
            <key>description</key>
            <string>The Unarchiver is a much more capable replacement for "Archive Utility.app", the built-in archive unpacker program on Mac OS X. The Unarchiver is designed to handle many more formats than Archive Utility, and to better fit in with the design of the Finder.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>The Unarchiver ist ein Ersatz für das in macOS enthaltene Komprimierungsprogramm mit deutlich mehr Fähigkeiten. The Unarchiver versteht mehr Formate und passt sich der grafische Oberfläche des Betriebssystems besser an.</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>MacPaw Inc.</string>
            <key>display_name</key>
            <string>The Unarchiver</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
        <key>pkginfo_keys_to_copy_from_sparkle_feed</key>
        <array>
            <string>minimum_os_version</string>
        </array>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.munki.TheUnarchiver</string>
</dict>
</plist>
