<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Big Sur Blocker and imports into Munki.

This recipe is based on cio.github.hjuutilainen.munki.BigSurBlocker and customized by wycomco (http://www.wycomco.de)
to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.BigSurBlocker</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>app_bigsur_blocker</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/bigsur_blocker</string>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
			</array>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Detect when "Install macOS Big Sur.app" installer application has launched, terminate the process and display an alert.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Dienstprogramme</string>
					<key>description</key>
					<string>Erkennt, wenn der Installer für Big Sur gestartet wird, beendet diesen Prozess und zeigt eine Fehlermeldung an.</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>Hannes Juutilainen</string>
			<key>display_name</key>
			<string>Big Sur Blocker</string>
			<key>minimum_os_version</key>
			<string>10.12</string>
			<key>maximum_os_version</key>
			<string>10.15.99</string>
			<key>name</key>
			<string>%NAME%</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.munki.BigSurBlocker</string>
</dict>
</plist>
