<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Handbrake disk image and imports into Munki. This recipe is based on com.github.autopkg.munki.Handbrake and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.Handbrake</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/handbrake</string>
		<key>NAME</key>
		<string>app_handbrake</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Video</string>
			<key>description</key>
			<string>HandBrake ist eine freie Software zur Transkodierung von Videodateien. Ursprünglich für BeOS entwickelt, ist das Programm heute für Mac OS X, Windows und Linux erhältlich. Es wird in Objective-C, C und C# entwickelt und als freie Software unter den Bedingungen der Version 3 der GNU General Public License (GPL) veröffentlicht. (Quelle: Wikipedia)
			
			HandBrake is a free and open-source transcoder for digital video files, originally developed in 2003 by Eric Petit to make ripping a film from a DVD to a data storage device easier. Since then, it has undergone many changes and revisions. (Source: Wikipedia)</string>
			<key>developer</key>
			<string>HandBrake Community</string>
			<key>display_name</key>
			<string>Handbrake</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.Handbrake</string>
</dict>
</plist>
