<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Apache OpenOffice and imports into Munki.
	
	This recipe is based on io.github.hjuutilainen.munki.OpenOffice and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.OpenOffice</string>
	<key>Input</key>
	<dict>
		<key>LANGUAGE</key>
		<string>de</string>
		<key>MUNKI_CATEGORY</key>
		<string>Produktivität</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/openoffice</string>
		<key>NAME</key>
		<string>app_openoffice</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Apache OpenOffice ist ein freies Office-Paket, das aus einer Kombination verschiedener Programme zur Textverarbeitung, Tabellenkalkulation, Präsentation und zum Zeichnen besteht. Ein Datenbankprogramm und ein Formeleditor sind ebenfalls enthalten.</string>
			<key>developer</key>
			<string>The Apache Software Foundation</string>
			<key>display_name</key>
			<string>Apache OpenOffice</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.munki.OpenOffice</string>
</dict>
</plist>
