<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of 1Password and imports into Munki. This recipe is based on io.github.hjuutilainen.munki.1Password and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.1Password</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Dienstprogramme</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/agilebits/1password</string>
		<key>NAME</key>
		<string>app_1password</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>1Password</string>
				<string>1Password mini</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>1Password ist ein Passwort-Manager, der sich nahtlos in alle relevanten Browser integrieren lässt.</string>
			<key>developer</key>
			<string>AgileBits</string>
			<key>display_name</key>
			<string>1Password</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.munki.1Password</string>
</dict>
</plist>
