<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of 1Password and imports into Munki. This recipe is based on io.github.hjuutilainen.munki.1Password and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.1Password</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/agilebits/1password</string>
		<key>NAME</key>
		<string>app_1password</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>1Password</string>
				<string>1Password mini</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>A password manager, digital vault, random password generator, form filler and secure digital wallet. 1Password remembers all your passwords for you, and keeps you safe behind the one password that only you know.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>1Password ist ein Passwort-Manager, der sich nahtlos in alle relevanten Browser integrieren lässt.</string>
					<key>category</key>
					<string>Dienstprogramme</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>AgileBits Inc.</string>
			<key>minimum_os_version</key>
			<string>10.12.0</string>
			<key>display_name</key>
			<string>1Password</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
 			<string>#!/bin/zsh

  if
 	[[ -e /Applications/1Password\ 7.app.zip ]]
 	then
 	/bin/rm /Applications/1Password\ 7.app.zip
 fi</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.munki.1Password</string>
</dict>
</plist>
