<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of GrandPerspective and imports into Munki. This recipe is based on com.github.jessepeterson.munki.GrandPerspective and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.grandperspective</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/grandperspective</string>
		<key>MUNKI_CATEGORY</key>
		<string>Utilites</string>
		<key>NAME</key>
		<string>app_grandperspective</string>
		<key>SOURCEFORGE_FILE_PATTERN</key>
		<string>GrandPerspective-[0-9_\.]*\.dmg</string>
		<key>SOURCEFORGE_PROJECT_NAME</key>
		<string>grandperspectiv</string>
		<key>APP_DESTINATION</key>
		<string>/Applications/Utilities</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>GrandPerspective is a small utility application for Mac that graphically shows the disk usage within a file system. It can help you to manage your disk, as you can easily spot which files and folders take up the most space. It uses a so called tree map for visualisation. Each file is shown as a rectangle with an area proportional to its size.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>GrandPerspective ist eine kleine Utility-Anwendung für Mac, die die Festplattennutzung in einem Dateisystem grafisch darstellt. Es kann Ihnen helfen, Ihre Festplatte zu verwalten, da Sie leicht erkennen können, welche Dateien und Ordner den meisten Speicherplatz beanspruchen. Es verwendet eine sogenannte Baumansicht zur Visualisierung. Jede Datei wird als Rechteck mit einer zur Dateigröße proportionalen Fläche angezeigt. Dateien in demselben Ordner werden zusammen angezeigt, ihre Platzierung ist jedoch beliebig.</string>
					<key>category</key>
					<string>Dienstprogramme</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>Erwin Bonsma</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>SourceForgeURLProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/GrandPerspective.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier &quot;net.sourceforge.grandperspectiv&quot; and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = &quot;3Z75QZGN66&quot;)
</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--destinationpath</string>
					<string>%APP_DESTINATION%</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
