<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Cisco Webex Meetings and imports it into Munki. repo

This recipe is based on com.github.dataJAR-recipes.munki.CiscoWebexMeetings and customized by wycomco (http://www.wycomco.de)
to support a different naming convention for munki and German as a default language.</string>
    <key>Identifier</key>
    <string>com.github.wycomco.munki.CiscoWebexMeetings</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>generic/apps/cisco/webexmeetings</string>
        <key>NAME</key>
        <string>app_webex_meetings</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>Cisco Webex Meetings.app</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>generic</string>
            </array>
            <key>category</key>
	        <string>Utilities</string>
            <key>description</key>
            <string>Experience online meetings from Cisco Webex, the Name you trust for robust video conferencing. Get file sharing for more productive online meetings from any device. Join Webex meetings anywhere.</string>
			<key>localized_strings</key>
			<dict>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Dienstprogramme</string>
					<key>description</key>
					<string>Setzen Sie auf Online-Meetings mit Cisco Webex, der bekannten Lösung für zuverlässige Videokonferenzen. Vom Gerät unabhängige Dateifreigaben sorgen für produktivere Online-Meetings. Sie können überall an Webex Meetings teilnehmen.</string>
				</dict>
				<key>fallback_locale</key>
				<string>en</string>
			</dict>
            <key>developer</key>
            <string>Cisco</string>
            <key>display_name</key>
            <string>Cisco Webex Meetings</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true />
            <key>unattended_uninstall</key>
            <true/>
            <key>uninstallable</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.munki.CiscoWebexMeetings</string>
</dict>
</plist>