<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Finds latest Office 2011 update, downloads the disk image and extracts the pkg. This recipe is based on com.github.autopkg.munki.Office2011Updates and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.Office2011Updates</string>
	<key>Input</key>
	<dict>
		<key>CULTURE_CODE</key>
		<string>0407</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/microsoft/office2011de</string>
		<key>NAME</key>
		<string>gen_upd_de_office2011</string>
		<key>VERSION</key>
		<string>latest</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>MSN Messenger</string>
				<string>Microsoft Lync</string>
				<string>Microsoft Cert Manager</string>
				<string>Microsoft Chart Converter</string>
				<string>Microsoft Clip Gallery</string>
				<string>Microsoft Entourage</string>
				<string>Microsoft Outlook</string>
				<string>Microsoft Error Reporting</string>
				<string>Microsoft Excel</string>
				<string>Microsoft Graph</string>
				<string>Microsoft Help Viewer</string>
				<string>Microsoft Language Register</string>
				<string>Microsoft Communicator</string>
				<string>Microsoft Messenger</string>
				<string>Microsoft PowerPoint</string>
				<string>Microsoft Query</string>
				<string>Microsoft Word</string>
				<string>My Day</string>
				<string>Organization Chart</string>
				<string>Expression Media</string>
				<string>Remote Desktop Connection</string>
				<string>Opera</string>
				<string>Google Chrome</string>
				<string>Firefox</string>
				<string>Safari</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Produktivität</string>
			<key>description</key>
			<string>Update für Microsoft Office 2011 (Word, Excel, Powerpoint und Outlook)</string>
			<key>developer</key>
			<string>Microsoft</string>
			<key>requires</key>
			<array>
				<string>gen_upd_de_office2011-14.1.0</string>
			</array>
			<key>update_for</key>
			<array>
				<string>gen_app_de_office2011</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>culture_code</key>
				<string>%CULTURE_CODE%</string>
				<key>munki_update_name</key>
				<string>%NAME%</string>
				<key>version</key>
				<string>%VERSION%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.munki.Office2011Updates/MSOffice2011UpdateInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Merge input pkginfo and additional_pkginfo generated by MSOffice2011UpdateInfoProvider</string>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
