<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the current release version of Google Chat and imports into Munki. This recipe is based on com.github.homebysix.munki.GoogleChat and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.GoogleChat</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Social Media</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/google/chat</string>
		<key>NAME</key>
		<string>app_googlechat</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Desktop app for the redesigned Google Hangouts Chat service.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>Desktop-App für das erneuerte Google Hangouts, jetzt "Chat" genannt.</string>
					<key>category</key>
					<string>Soziale Netze</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>Google, Inc.</string>
			<key>display_name</key>
			<string>Chat</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.munki.GoogleChat</string>
</dict>
</plist>
