<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of Sketch and imports it into Munki.
	
	This recipe is based on com.github.foigus.munki.Sketch and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.
	</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.Sketch</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/bohemiancoding</string>
		<key>NAME</key>
		<string>app_sketch</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>description</key>
			<string>Sketch is a proprietary vector graphics editor for Apple's macOS, developed by the Dutch company Bohemian Coding. It won an Apple Design Award in 2012. Sketch was first released on 7 September 2010. (Source: Wikipedia)</string>
			<key>category</key>
			<string>Graphics and design</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>Sketch ist ein Design-Toolkit, mit dessen Hilfe Sie Ihre beste Arbeit erstellen können – von Ihren ersten Ideen bis hin zum fertigen Kunstwerk.</string>
					<key>category</key>
					<string>Grafik und Design</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>Bohemian Coding</string>
			<key>display_name</key>
			<string>Sketch</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.munki.Sketch</string>
</dict>
</plist>
