<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Google Chrome disk image and imports into Munki. This recipe is based on com.github.autopkg.munki.google-chrome and customized by wycomco (http://www.wycomco.de) to support a different naming convention and German and English locales.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.google-chrome</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/google/chrome</string>
		<key>NAME</key>
		<string>app_googlechrome</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Google Chrome is a freeware web browser developed by Google. It was first released in September 2008, for Microsoft Windows, and was later ported to Linux, macOS, iOS and Android. (Source: Wikipedia)</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>Google Chrome ist ein Webbrowser, der vom Unternehmen Google Inc. entwickelt wird und seit dem 2. September 2008 verfügbar ist. Am 11. Dezember 2008 erschien die erste stabile Version. Zentrales Konzept ist die Aufteilung des Browsers in optisch und auf Prozessebene getrennte Browser-Tabs. Google Chrome baut auf der HTML-Rendering-Engine WebKit auf, seit Version 28 kommt die WebKit-Abspaltung Blink zum Einsatz. (Quelle: Wikipedia)</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>Google</string>
			<key>display_name</key>
			<string>Google Chrome</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.google-chrome</string>
</dict>
</plist>
