<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Google Chrome disk image and imports into Munki. This recipe is based on com.github.autopkg.munki.google-chrome and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.google-chrome</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/google/chrome</string>
		<key>NAME</key>
		<string>gen_app_multi_googlechrome</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Produktivität</string>
			<key>description</key>
			<string>Google Chrome ist ein Webbrowser, der vom Unternehmen Google Inc. entwickelt wird und seit dem 2. September 2008 verfügbar ist. Am 11. Dezember 2008 erschien die erste stabile Version. Zentrales Konzept ist die Aufteilung des Browsers in optisch und auf Prozessebene getrennte Browser-Tabs.

Google Chrome baut auf der HTML-Rendering-Engine WebKit auf, seit Version 28 kommt die WebKit-Abspaltung Blink zum Einsatz.

Google Chrome ist ein integraler Bestandteil des Google Chrome OS, Googles auf Linux basierendem Betriebssystem für Netbooks. (Quelle: Wikipedia)</string>
			<key>developer</key>
			<string>Google</string>
			<key>display_name</key>
			<string>Google Chrome</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.google-chrome</string>
</dict>
</plist>
