<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of GIMP from gimp.org and imports into Munki.
	
	This recipe is based on io.github.hjuutilainen.munki.GIMP and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.GIMP2</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.munki.GIMP</string>
</dict>
</plist>
