<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the most recent version of VMware Fusion 8 and imports it into Munki.

This recipe is based on com.github.dataJAR-recipes.munki.VMware Fusion 8 and customized by wycomco (http://www.wycomco.de)
to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.Fusion8</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>app_fusion8</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/vmware</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>VMware Fusion is the easiest, fastest, and most reliable way to run Windows and other x86 based operating systems on a Mac without rebooting.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>VMware Fusion ist die einfachste, schnellste und zuverlässigste Möglichkeit, Windows und andere x86-basierte Betriebssysteme auf einem Mac ohne Neustart laufen zu lassen.</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>VMware</string>
			<key>display_name</key>
			<string>VMWare Fusion Pro 8</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.5</string>
	<key>ParentRecipe</key>
	<string>com.github.dataJAR-recipes.munki.VMware Fusion 8</string>
</dict>
</plist>
