<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Adobe Flash Player installer, extracts the embedded package, imports into Munki. This recipe is based on com.github.autopkg.munki.FlashPlayerExtractPackage and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.FlashPlayerExtractPackage</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/plugins/adobe/flashplayer</string>
		<key>NAME</key>
		<string>flashplayer</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Firefox</string>
				<string>Safari</string>
				<string>Opera</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Dienstprogramme</string>
			<key>description</key>
			<string>Adobe® Flash® Player ist ein Browser-Plugin für Safari, Firefox und Opera. Es ermöglicht die Darstellung von multimedialen Inhalten auf diversen Websites.
			
			Adobe Flash Player is freeware for using content created on the Adobe Flash platform, including viewing multimedia contents, executing rich Internet applications, and streaming audio and video.</string>
			<key>developer</key>
			<string>Adobe</string>
			<key>display_name</key>
			<string>Adobe Flash Player</string>
			<key>minimum_os_version</key>
			<string>10.6.8</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.FlashPlayerExtractPackage</string>
</dict>
</plist>
