<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Webex Desktop Meetings App disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.wycomco.munki.webexapp</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>app_webexapp</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>generic/apps/cisco/webexdesktopapp</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>generic</string>
            </array>
			<key>category</key>
			<string>Productivity</string>
            <key>description</key>
            <string>To start or join meetings, you must download, install, and configure the Webex Meetings desktop application. With the Webex Meetings desktop application, you can join meetings from within the application and get them started quickly without having to go to the calendar or Webex site. You can also add a Webex meeting directly in Microsoft Outlook. The Webex Meetings desktop application can also automatically detect nearby video devices so you can share your desktop on a video device or automatically call up your desktop when you join a meeting.</string>
            <key>display_name</key>
            <string>Webex Desktop Meetings Application</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>Wenn Sie Meetings starten oder ihnen beitreten möchten, müssen Sie die Webex Meetings-Desktop-Anwendung herunterladen, installieren und konfigurieren. Mit der Webex Meetings-Desktop-Anwendung können Sie innerhalb der Anwendung Meetings aus der Liste beitreten und sie schnell starten, ohne zum Kalender oder zur Webex-Site zu gehen. Sie können auch ein Webex-Meeting direkt in Microsoft Outlook hinzufügen. Die Webex Meetings-Desktop-Anwendung kann außerdem automatisch Videogeräte in der Nähe erkennen, sodass Sie Ihren Desktop auf einem Videogerät teilen oder automatisch aufrufen können, wenn Sie einem Meeting beitreten.</string>
                    <key>display_name</key>
                    <string>Webex Meetings-Desktop-Anwendung</string>
				</dict>
			</dict>
        	<key>minimum_os_version</key>
            <string>10.9.0</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.wycomco.download.webexapp</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>munkiimport_appname</key>
				<string>%NAME%</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>