<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Epic Games Launcher and imports it into Munki. This recipe is based on com.github.n8felton.munki.EpicGamesLauncher and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.EpicGamesLauncher</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/epic</string>
		<key>NAME</key>
		<string>app_epicgameslauncher</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>The Epic Games Launcher is used to download and launch binary versions of the Unreal Engine 4 (as opposed to the engine source code from GitHub), as well as serve as a location to download additional content and view news and blog posts.</string>
			<key>developer</key>
			<string>Epic Games, Inc.</string>
			<key>display_name</key>
			<string>Epic Games Launcher</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>Der Epic Games Launcher wird zum Herunterladen und Starten von Binärversionen der Unreal Engine 4 (im Gegensatz zum Engine-Quellcode von GitHub) sowie zum Herunterladen zusätzlicher Inhalte und zum Anzeigen von Nachrichten und Blog-Posts verwendet.</string>
					<key>category</key>
					<string>Dienstprogramme</string>
				</dict>
			</dict>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.munki.EpicGamesLauncher</string>
</dict>
</plist>
