<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Dropbox and imports into Munki. This recipe is based on com.github.autopkg.munki.dropbox and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.dropbox</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/dropbox</string>
		<key>NAME</key>
		<string>app_dropbox</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>description</key>
			<string>Dropbox ist ein kostenloser Cloud-Service zum synchronisieren von Dateien auf verschiedenen Geräten.</string>
			<key>display_name</key>
			<string>Dropbox</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/sh
# based on Ruby postinstall script by Riley Shott:
# https://groups.google.com/group/munki-dev/browse_thread/thread/a2813e7f62535f13/63d127534541f863
# modifications:
# - always extract the helper tool with each install instead of skipping if it exists
# - remove xattr com.apple.quarantine removal, as Munki will have already done this upon 
#   installation; normal autopkg runs also won't quarantine the download to begin with

HELPER_SRC_PATH=/Applications/Dropbox.app/Contents/Resources/DropboxHelperInstaller.tgz
HELPER_DST_DIR=/Library/DropboxHelperTools
HELPER_DST_PATH="$HELPER_DST_DIR/DropboxHelperInstaller"

if [ -e "$HELPER_SRC_PATH" ]; then
  [ -d "$HELPER_DST_DIR" ] || mkdir "$HELPER_DST_DIR"
  /usr/bin/tar -C "$HELPER_DST_DIR" -xz -f "$HELPER_SRC_PATH"
  /bin/chmod 04511 "$HELPER_DST_PATH"
  /usr/sbin/chown root:wheel "$HELPER_DST_PATH"
else
  echo "Expected $HELPER_SRC_PATH, but it was not present in the Dropbox dmg."
  exit 1
fi
</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.dropbox</string>
</dict>
</plist>
