<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Spotify and imports into Munki. This recipe is based on com.github.autopkg.munki.Spotify and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.Spotify</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/spotify</string>
		<key>NAME</key>
		<string>app_spotify</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Music</string>
			<key>description</key>
			<string>Spotify is a music, podcast, and video streaming service launched on 7 October 2008. It is developed and owned by Spotify Technology SA in Stockholm, Sweden. It provides DRM-protected content from record labels and media companies. (Source: Wikipedia)</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>Spotify (engl. to spot ‚entdecken‘ und to identify ‚identifizieren‘) ist ein Musikstreaming-Dienst, der es ermöglicht, DRM-geschützte Musik aus einer Reihe von großen Plattenlabels wie Sony, EMI, Warner Music Group und Universal sowie zahlreicher kleiner Labels zu hören. Der Dienst wurde im Oktober 2008 von dem schwedischen Start-up Spotify AB gestartet. Er ist in vielen Ländern der Welt verfügbar. (Quelle: Wikipedia)</string>
					<key>category</key>
					<string>Musik</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>Spotify</string>
			<key>display_name</key>
			<string>Spotify</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.Spotify</string>
</dict>
</plist>
