<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Excel 2016 multilingual update pkg,
appends the version to the end of the filename, and imports into
Munki.

If this is an update_for something, you may define this in your
pkginfo Input override below.

CHANNEL can be set to several values in order to get more frequent updates
that can be used for testing purposes. See the explanations in the 'Channel'
table at http://macadmins.software/docs/MAU_ManifestServer.pdf. Supported
values are 'Production', 'InsiderSlow', 'InsiderFast', or a custom UUID to be
inserted into the Base URL.

LOCALE_ID sets the locale for a descriptive text that will be
extracted from the Microsoft update metadata. See
https://msdn.microsoft.com/en-us/goglobal/bb964664.aspx
for more information about locale IDs.

VERSION supports two values: 'latest', and 'latest-delta', defaulting to
'latest'. If 'latest-delta' is selected, the delta update will be selected
instead of the full update.

If 'latest-delta' is selected, the pkginfo's installs item that's generated
will also include a 'minimum_update_version' set, declaring a minimum app
version to which this delta can be applied. It will also have a 'requires'
item set to this minimum update version, whose name can be set explicitly
with 'munki_required_update_name'. If left blank, NAME will be used.

PLEASE NOTE: This recipe doesn't currently support a workflow where _both_
full and delta updates can be imported and clients will automatically select
only the correct update. It only tries to add as much "safety" as possible
when importing a delta update. Choosing to import delta updates will likely
require additional work on the part of the admin (for example, using an
installcheck_script).

This recipe is based on com.github.autopkg.munki.MSExcel2016 and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.
</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.MSExcel2016</string>
	<key>Input</key>
	<dict>
		<key>LOCALE_ID</key>
		<string>1031</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/microsoft/office2016</string>
		<key>NAME</key>
		<string>upd_excel2016</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Microsoft Excel</string>
				<string>Microsoft Error Reporting</string>
				<string>Microsoft Auto Update</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>display_name</key>
			<string>Microsoft Excel 2016 for Mac</string>
            <key>category</key>
            <string>Productivity</string>
            <key>description</key>
            <string>Microsoft Excel is a spreadsheet developed by Microsoft for Windows, macOS, Android and iOS. It features calculation, graphing tools, pivot tables, and a macro programming language called Visual Basic for Applications. Excel forms part of Microsoft Office. (Source: Wikipedia)</string>
        	<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>Microsoft Excel ist das am weitesten verbreitete Tabellenkalkulationsprogramm. Excel gehört zum Microsoft-Office-365-Abonnement und ist sowohl für Windows als auch für macOS verfügbar. (Quelle: Wikipedia)</string>
					<key>category</key>
					<string>Produktivität</string>
    	    		<key>display_name</key>
        			<string>Microsoft Excel 2016 für Mac</string>
				</dict>
			</dict>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
                        <string>#!/bin/sh

if [ -d "/Library/Application Support/Microsoft/MAU2.0" ]; then
   rm -rf /Library/Application\ Support/Microsoft/MAU2.0/
   launchctl remove com.microsoft.autoupdate.helper
   rm -f /Library/PrivilegedHelperTools/com.microsoft.autoupdate.helper
   rm -f /Library/LaunchDaemons/com.microsoft.autoupdate.helper.plist
   echo "Removed Microsoft AutoUpdate"
fi

exit 0</string>
			<key>maximum_os_version</key>
			<string>10.14.6</string>
			<key>unattended_install</key>
			<true/>
			<key>update_for</key>
			<array>
				<string>app_office2016</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.MSExcel2016</string>
</dict>
</plist>
