<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>This recipe downloads and imports the full installer pkg for Microsoft OneNote 365 into Munki
    
	This is accomplished via the Office 365 recipes from rtrouton-recipes.
	
    These in turn, utilise the fwlink's found on macadmins.software
        
    This recipe is based on com.github.dataJAR-recipes.munki.Microsoft OneNote 365 and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.
	</string>
    <key>Identifier</key>
    <string>com.github.wycomco.munki.MSOneNote365</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>app_onenote365</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>generic/apps/microsoft/office365</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>Microsoft Auto Update</string>
                <string>Microsoft Error Reporting</string>
                <string>Microsoft OneNote</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>generic</string>
            </array>
			<key>category</key>
			<string>Productivity</string>
            <key>description</key>
            <string>Your world, organized. Get organized in notebooks you can divide into sections and pages. With easy navigation and search, you’ll always find your notes right where you left them.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>Ihre Welt, organisiert. Ordnen Sie sich in Notizbüchern an, die Sie in Abschnitte und Seiten unterteilen können. Mit der einfachen Navigation und Suche finden Sie Ihre Notizen immer dort, wo Sie sie hinterlassen haben.</string>
				</dict>
			</dict>
            <key>display_name</key>
            <string>Microsoft OneNote</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.munki.Microsoft OneNote 365</string>
</dict>
</plist>