<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Outlook 2016 multilingual update pkg,
appends the version to the end of the filename, and imports into
Munki.

If this is an update_for something, you may define this in your
pkginfo Input override below.

CHANNEL can be set to several values in order to get more frequent updates
that can be used for testing purposes. See the explanations in the 'Channel'
table at http://macadmins.software/docs/MAU_ManifestServer.pdf. Supported
values are 'Production', 'InsiderSlow', 'InsiderFast', or a custom UUID to be
inserted into the Base URL.

LOCALE_ID sets the locale for a descriptive text that will be
extracted from the Microsoft update metadata. See
https://msdn.microsoft.com/en-us/goglobal/bb964664.aspx
for more information about locale IDs.

VERSION supports two values: 'latest', and 'latest-delta', defaulting to
'latest'. If 'latest-delta' is selected, the delta update will be selected
instead of the full update.

If 'latest-delta' is selected, the pkginfo's installs item that's generated
will also include a 'minimum_update_version' set, declaring a minimum app
version to which this delta can be applied. It will also have a 'requires'
item set to this minimum update version, whose name can be set explicitly
with 'munki_required_update_name'. If left blank, NAME will be used.

PLEASE NOTE: This recipe doesn't currently support a workflow where _both_
full and delta updates can be imported and clients will automatically select
only the correct update. It only tries to add as much "safety" as possible
when importing a delta update. Choosing to import delta updates will likely
require additional work on the part of the admin (for example, using an
installcheck_script).

This recipe is based on com.github.autopkg.munki.MSOutlook2016 and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.
</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.MSOutlook2016</string>
	<key>Input</key>
	<dict>
		<key>LOCALE_ID</key>
		<string>1031</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/microsoft/office2016</string>
		<key>NAME</key>
		<string>upd_outlook2016</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Microsoft Outlook</string>
				<string>Microsoft Error Reporting</string>
				<string>Microsoft Auto Update</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>display_name</key>
			<string>Microsoft Outlook 2016 for Mac</string>
            <key>category</key>
            <string>Productivity</string>
            <key>description</key>
            <string>Microsoft Outlook is a personal information manager. It is part of the Microsoft Office suite and is available for Windows and for macOS.</string>
        	<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>Microsoft Outlook ist eine verbreitete Software der Firma Microsoft zum Empfangen und Versenden von E-Mails sowie zum Verwalten von Terminen, Kontakten, Aufgaben und Notizen (Personal Information Manager). Es gehört zum gehört zum Microsoft Office-Paket und ist sowohl für Windows als auch für macOS verfügbar.</string>
					<key>category</key>
					<string>Produktivität</string>
    	    		<key>display_name</key>
        			<string>Microsoft Outlook 2016 für Mac</string>
				</dict>
			</dict>
			<key>name</key>
			<string>%NAME%</string>
			<key>maximum_os_version</key>
			<string>10.14.6</string>
			<key>unattended_install</key>
			<true/>
			<key>update_for</key>
			<array>
				<string>app_office2016</string>
			</array>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.MSOutlook2016</string>
</dict>
</plist>
