<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of TeamViewer and imports into Munki.

This recipe is based on io.github.hjuutilainen.munki.TeamViewer and customized by wycomco (http://www.wycomco.de)
to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.override.TeamViewer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>app_teamviewer</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/teamviewer</string>
		<key>MUNKI_CATEGORY</key>
		<string>Utilities</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>All-In-One Solution for Remote Access and Support over the Internet.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Dienstprogramme</string>
					<key>description</key>
					<string>Komplettlösung für Fernzugriff und Support über das Internet.</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>TeamViewer GmbH</string>
			<key>display_name</key>
			<string>TeamViewer</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.munki.TeamViewer</string>
</dict>
</plist>
