<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Microsoft Remote Desktop installer pkg and imports it into Munki. This recipe is based on com.github.foigus.munki.microsoftremotedesktop and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.microsoftremotedesktop</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/microsoft/microsoftremotedesktop</string>
		<key>NAME</key>
		<string>app_microsoftremotedesktopx</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Microsoft Remote Desktop X</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>Use the Microsoft Remote Desktop app to connect to a remote computer or to virtual apps and desktops your administrator has made available. The app enables productive work anywhere.</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>description</key>
					<string>Stellen Sie über die Microsoft-Remotedesktop-App eine Verbindung mit einem Remotecomputer oder mit virtuellen Apps und Desktops her, die Ihr Administrator verfügbar gemacht hat. Die App ermöglicht produktives Arbeiten an jedem beliebigen Ort.</string>
					<key>category</key>
					<string>Dienstprogramme</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>Microsoft</string>
			<key>display_name</key>
			<string>Microsoft Remote Desktop</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>minimum_os_version</key>
			<string>10.10</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.foigus.munki.microsoftremotedesktop</string>
</dict>
</plist>
