<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Skype disk image and imports into Munki. This recipe is based on com.github.autopkg.munki.Skype and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.Skype</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/microsoft/skype</string>
		<key>NAME</key>
		<string>app_skype</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Soziale Netze</string>
			<key>description</key>
			<string>Skype (englische Aussprache [skaɪp]) ist eine kostenlose IP-Telefonie-Software des Unternehmens Microsoft mit Instant-Messaging-Funktion, Dateiübertragung und Videotelefonie, die ein proprietäres Netzwerkprotokoll verwendet.

Sie ermöglicht das kostenlose Telefonieren zwischen Skype-Kunden via Internet. Internettelefonate mit Kunden anderer Anbieter sind nicht möglich. Verbindungen ins Festnetz und zu Mobiltelefonen sind gebührenpflichtig („SkypeOut“). Um Anrufe aus dem herkömmlichen Telefonnetz entgegenzunehmen, ist der Kauf einer Online-Rufnummer erforderlich („SkypeIn“). Die Einrichtung einer solchen Rufnummer ist für rund 25 Länder möglich, ohne physisch in diesen Ländern anwesend zu sein. Für einige Länder ist aus rechtlichen Gründen der Nachweis des Wohnsitzes (aber nicht der tatsächlichen Anwesenheit dort) erforderlich; das betrifft gegenwärtig Frankreich, Deutschland, die Niederlande, die Schweiz und Südkorea. In der aktuellen Version für Microsoft Windows und Mac OS X sind Konferenzschaltungen mit bis zu 25 Gesprächsteilnehmern möglich. (Quelle: Wikipedia)</string>
			<key>developer</key>
			<string>Microsoft</string>
			<key>display_name</key>
			<string>Skype</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.Skype</string>
</dict>
</plist>
