<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of GoTo Opener and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.GoToOpener</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/gotomeeting</string>
		<key>NAME</key>
		<string>app_gotoopener</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>The GoTo Opener app is a helper application to launch you into active sessions.</string>
				<key>localized_strings</key>
				<dict>
					<key>fallback_locale</key>
					<string>en</string>
					<key>de</key>
					<dict>
						<key>description</key>
						<string>Die GoTo Opener-App ist eine Hilfsanwendung, mit der Sie aktive Sitzungen starten können.</string>
						<key>category</key>
						<string>Dienstprogramme</string>
					</dict>
				</dict>
			<key>developer</key>
			<string>LogMeIn</string>
			<key>display_name</key>
			<string>GoTo Opener</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.wycomco.download.GoToOpener</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
