<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Cyberduck and imports into Munki. This recipe is based on com.github.autopkg.munki.Cyberduck and customized by wycomco (http://www.wycomco.de) to support a different naming convention for munki and German as a default language.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.munki.cyberduck</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>generic/apps/cyberduck</string>
		<key>NAME</key>
		<string>app_cyberduck</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>generic</string>
			</array>
			<key>description</key>
			<string>Use Cyberduck as default system wide protocol handler for FTP and SFTP. Open .inetloc files and .duck bookmark files from the Finder. Notifications in system tray (Windows) and the Notification Center (Mac).</string>
			<key>category</key>
			<string>Productivity</string>
			<key>localized_strings</key>
			<dict>
				<key>fallback_locale</key>
				<string>en</string>
				<key>de</key>
				<dict>
					<key>category</key>
					<string>Produktivität</string>
					<key>description</key>
					<string>Cyberduck ist ein freier FTP-Client, ursprünglich für Mac OS X entwickelt. Am 8. März 2011 erschien Version 4.0, die auch unter Microsoft Windows lauffähig ist. Cyberduck unterstützt Verbindungen per FTP, FTP/TLS, WebDAV und SSH File Transfer Protocol sowie einfaches Hoch- und Herunterladen mittels Drag and Drop. Auch die Synchronisation von Dateien und Ordnern und das Öffnen und Bearbeiten von Dateien in einem Texteditor ist möglich. Cyberduck enthält eine Lesezeichenfunktion und unterstützt den Netzwerkstandard Bonjour sowie den Passwortmanager Schlüsselbund. Bestehende Lesezeichen aus anderen FTP-Clients, etwa FileZilla, können importiert werden. Soweit installiert, wird der Benutzer mittels Growl über den Verbindungsstatus und den Ladefortschritt informiert. Cyberduck ist in einer großen Zahl von Sprachen verfügbar, darunter unter anderem Chinesisch, Deutsch, Englisch, Französisch, Japanisch und Spanisch. (Quelle: Wikipedia)</string>
				</dict>
			</dict>
			<key>developer</key>
			<string>Cyberduck</string>
			<key>display_name</key>
			<string>Cyberduck</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.Cyberduck</string>
</dict>
</plist>
